In [1]:
import numpy as np
from pandas import DataFrame
from pandas import Series

In [2]:
people = {'name':['Jim','Rob','Tom'],'age':[22,44,55],'location':['US','UK','AUS']}
frame = DataFrame(people)
frame

  name  age location
0  Jim   22       US
1  Rob   44       UK
2  Tom   55      AUS

In [3]:
frame = DataFrame(people,columns=['name','location','age'])
frame

  name location  age
0  Jim       US   22
1  Rob       UK   44
2  Tom      AUS   55

In [4]:
frame = DataFrame(people,columns=['name','location','age','salary'])
frame

  name location  age salary
0  Jim       US   22    NaN
1  Rob       UK   44    NaN
2  Tom      AUS   55    NaN

In [5]:
frame['location']

0     US
1     UK
2    AUS
Name: location, dtype: object

In [6]:
frame.location

0     US
1     UK
2    AUS
Name: location, dtype: object

In [7]:
frame.loc[1]

name        Rob
location     UK
age          44
salary      NaN
Name: 1, dtype: object

In [8]:
frame.salary = 5000
frame

  name location  age  salary
0  Jim       US   22    5000
1  Rob       UK   44    5000
2  Tom      AUS   55    5000

In [9]:
salaries = Series([1000,2000,3000])
frame.salary = salaries
frame

  name location  age  salary
0  Jim       US   22    1000
1  Rob       UK   44    2000
2  Tom      AUS   55    3000

In [10]:
del frame['salary']
frame

  name location  age
0  Jim       US   22
1  Rob       UK   44
2  Tom      AUS   55

**Reindexing**

In [11]:
s = Series([10,20,30,40,50],index=['c','a','d','b','e'])
s

c    10
a    20
d    30
b    40
e    50
dtype: int64

In [13]:
s = s.reindex(['a','b','c','d','e'])
s

a    20
b    40
c    10
d    30
e    50
dtype: int64

In [14]:
d = DataFrame(np.arange(9).reshape((3,3)),index=['c','a','b'],columns=['apple','mango','banana'])
d

   apple  mango  banana
c      0      1       2
a      3      4       5
b      6      7       8

In [18]:
d = d.reindex(['a','b','c'])
d

   apple  mango  banana
a      3      4       5
b      6      7       8
c      0      1       2

In [19]:
d = d.reindex(columns=['mango','banana','apple'])
d

   mango  banana  apple
a      4       5      3
b      7       8      6
c      1       2      0